package main

import (
	"fmt"
	"reflect"
	"strings"
	"unsafe"
)

func __main() {
	str := "[123]文本内容"
	prefix := "[123]"
	fmt.Printf("str: %+v addr: %+v len: %+v\n", str, (*reflect.StringHeader)(unsafe.Pointer(&str)).Data,
		(*reflect.StringHeader)(unsafe.Pointer(&str)).Len)
	str = strings.TrimPrefix(str, prefix)
	fmt.Printf("str: %+v addr: %+v len: %+v\n", str, (*reflect.StringHeader)(unsafe.Pointer(&str)).Data,
		(*reflect.StringHeader)(unsafe.Pointer(&str)).Len)
}

func main() {
	reply := "金服哈卡就会发开发看卡时间粉红色的接口和会计师费卡积分工会卡缴费哈哈卡机河南科技安费诺卡机回复哈加客户贷款爱斯达克骄傲和妇女把自己喜欢科技新城江岸卡计划的痕迹啊哈犯法看见你反垃圾费蓝飞机烦恼数据库表是昆士兰芙兰达看你的卡不到花花卡会返回案件话费卡就能发卡机步伐加快并发放 奥科吉发哈讲课费哈开发你看阿开发接口翻倍卡就不返回客户爱发科减肥那空间分布咖啡馆看卡夫卡解放碑卡级别发课表安抚哈客服那开发开放把课本副科级阿发空间发开发南法立法哪里发货哪里放那里房价按链接啊安抚那幅画那间咖啡八开机放八角可否把科技发卡金服哈卡就会发开发看卡时间粉红色的接口和会计师费卡积分工会卡缴费哈哈卡机河南科技安费诺卡机回复哈加客户贷款爱斯达克骄傲和妇女把自己喜欢科技新城江岸卡计划的痕迹啊哈犯法看见你反垃圾费蓝飞机烦恼数据库表是昆士兰芙兰达看你的卡不到花花卡会返回案件话费卡就能发卡机步伐加快并发放 奥科吉发哈讲课费哈开发你看阿开发接口翻倍卡就不返回客户爱发科减肥那空间分布咖啡馆看卡夫卡解放碑卡级别发课表安抚哈客服那开发开放把课本副科级阿发空间发开发南法立法哪里发货哪里放那里房价按链接啊安抚那幅画那间咖啡八开机放八角可否把科技发卡金服哈卡就会发开发看卡时间粉红色的接口和会计师费卡积分工会卡缴费哈哈卡机河南科技安费诺卡机回复哈加客户贷款爱斯达克骄傲和妇女把自己喜欢科技新城江岸卡计划的痕迹啊哈犯法看见你反垃圾费蓝飞机烦恼数据库表是昆士兰芙兰达看你的卡不到花花卡会返回案件话费卡就能发卡机步伐加快并发放 奥科吉发哈讲课费哈开发你看阿开发接口翻倍卡就不返回客户爱发科减肥那空间分布咖啡馆看卡夫卡解放碑卡级别发课表安抚哈客服那开发开放把课本副科级阿发空间发开发南法立法哪里发货哪里放那里房价按链接啊安抚那幅画那间咖啡八开机放八角可否把科技发卡金服哈卡就会发开发看卡时间粉红色的接口和会计师费卡积分工会卡缴费哈哈卡机河南科技安费诺卡机回复哈加客户贷款爱斯达克骄傲和妇女把自己喜欢科技新城江岸卡计划的痕迹啊哈犯法看见你反垃圾费蓝飞机烦恼数据库表是昆士兰芙兰达看你的卡不到花花卡会返回案件话费卡就能发卡机步伐加快并发放 奥科吉发哈讲课费哈开发你看阿开发接口翻倍卡就不返回客户爱发科减肥那空间分布咖啡馆看卡夫卡解放碑卡级别发课表安抚哈客服那开发开放把课本副科级阿发空间发开发南法立法哪里发货哪里放那里房价按链接啊安抚那幅画那间咖啡八开机放八角可否把科技发卡金服哈卡就会发开发看卡时间粉红色的接口和会计师费卡积分工会卡缴费哈哈卡机河南科技安费诺卡机回复哈加客户贷款爱斯达克骄傲和妇女把自己喜欢科技新城江岸卡计划的痕迹啊哈犯法看见你反垃圾费蓝飞机烦恼数据库表是昆士兰芙兰达看你的卡不到花花卡会返回案件话费卡就能发卡机步伐加快并发放 奥科吉发哈讲课费哈开发你看阿开发接口翻倍卡就不返回客户爱发科减肥那空间分布咖啡馆看卡夫卡解放碑卡级别发课表安抚哈客服那开发开放把课本副科级阿发空间发开发南法立法哪里发货哪里放那里房价按链接啊安抚那幅画那间咖啡八开机放八角可否把科技发卡金服哈卡就会发开发看卡时间粉红色的接口和会计师费卡积分工会卡缴费哈哈卡机河南科技安费诺卡机回复哈加客户贷款爱斯达克骄傲和妇女把自己喜欢科技新城江岸卡计划的痕迹啊哈犯法看见你反垃圾费蓝飞机烦恼数据库表是昆士兰芙兰达看你的卡不到花花卡会返回案件话费卡就能发卡机步伐加快并发放 奥科吉发哈讲课费哈开发你看阿开发接口翻倍卡就不返回客户爱发科减肥那空间分布咖啡馆看卡夫卡解放碑卡级别发课表安抚哈客服那开发开放把课本副科级阿发空间发开发南法立法哪里发货哪里放那里房价按链接啊安抚那幅画那间咖啡八开机放八角可否把科技发卡"
	fmt.Println(len(reply))
	tmp := []rune(reply)
	reply = string(tmp[0:100])
	fmt.Println(reply)

}
